UCB_CS61_lec27.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第二十七课 Balanced Search Tree
#+PROPERTY: header-args:ipython :session 第二十七课 Balanced Search Tree
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:nil ^:nil _:nil tags:not-in-toc
#+TITLE: 第二十七课 四种 Balanced Search Tree
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* 2-3-4 TREES
Balaced tree(Not all are binary):
1. ~234~ tree(a kind of B tree): ordered perfectly balance tree
2. ~splay tree~ (BST)
3. ~AVL tree~ (BST)(height-balanced)
5. ~Black-Red tree~ (BST)(convert from/to 234-tree)(black-height)

Last lecture, we learned about the Ordered Dictionary ADT, and we learned one
data structure for implementing it: ~*binary search trees*~. Today we learn a
faster one.

A ~2-3-4~ tree is a _perfectly balanced tree_. It has a big advantage over
regular binary search trees: because the tree is perfectly balanced, find,
insert, and remove operations take _O(log n)_ time, _all of the leaves have the
same depth_, even in the worst case.

2-3-4 trees are thus named because every node has _2, 3, or 4 children_, except
leaves, which are all at the bottom level of the tree.  Each node stores
_1, 2, or 3 entries_, which determine how other entries are distributed among its
children's subtrees.

*Number of childern = keys + 1*

#+BEGIN_EXAMPLE
2 keys node has 3 children

                | key1 |  key2 |
                /     |        \
             /--      |         ---\
| []< key1 |   | key1 <[]< key2 |   | [] > key2 |

#+END_EXAMPLE


Each internal (non-leaf) node has one more child than entries.  For example,
a node with keys [20, 40, 50] has four children.
- Eack key k in the subtree rooted at the first child satisfies k <= 20;
- at the second child, 20 <= k <= 40;
- at the third child, 40 <= k <= 50;
- and at the fourth child, k >= 50.
like this [[lec27-pic1]]

234-tree 也是 order 的,因为 binarytree 就是 ordered

** Main api of 234-tree
WARNING:  The algorithms for insertion and deletion I'll discuss today are
different from those discussed by Goodrich and Tamassia.  The text presents
"bottom-up" 2-3-4 trees, so named because the effects of node splits at the
bottom of the tree can work their way back up toward the root.  I'll discuss
"top-down" 2-3-4 trees, in which insertion and deletion finish at the leaves.
Top-down 2-3-4 trees are usually faster than bottom-up ones, because both trees
search down from the root to the leaves, but only the bottom-up trees sometimes
go back up to the root.  Goodrich and Tamassia call 2-3-4 trees "(2, 4) trees".

2-3-4 trees are a type of B-tree, which you may learn about someday in
connection with fast disk access for database systems.  B-trees on disks
usually use the top-down insertion/deletion algorithms, because accessing
a disk track is slow, so you'd rather not revisit it multiple times.

*** [1]  Entry find(Object k);

    #+NAME: lec27-pic1
    #+BEGIN_EXAMPLE
Finding an entry is straightforward.        ==========
Start at the root.  At each node,           +20 40 50+
check for the key k; if it's not         /--==========------\
present, move down to the           /---/      /  \          \-----\
appropriate child chosen by     ----      ----      ----            =======
comparing k against the keys.   |14|      |32|      |43|            +70 79+
Continue until k is found,      ----      ----      ----            =======
or k is not found at a          /  \      /  \      /  \            /  |  \            <<lec27-pic1>>
leaf node.  For example,     ---- ---- ---- ---- ---- ---- ---------- ==== ----
find(74) visits the          |10| |18| |25| |33| |42| |47| |57 62 66| +74+ |81|
double-lined boxes at right. ---- ---- ---- ---- ---- ---- ---------- ==== ----
    #+END_EXAMPLE

Incidentally, you can define an inorder traversal on 2-3-4 trees analogous to
that on binary trees, and it visits the keys in sorted order.
