UCB_CS61_lec27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 22:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十七课 四种 Balanced Search Tree</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十七课 四种 Balanced Search Tree</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1cf2b57">2-3-4 TREES</a>
<ul>
<li><a href="#orgf0737e4">Main api of 234-tree</a>
<ul>
<li><a href="#orgaf25218">[1]  Entry find(Object k);</a></li>
<li><a href="#orga63e38b">[2]  Entry insert(Object k, Object e);</a></li>
<li><a href="#org9e19393">[3]  Entry remove(Object k);</a></li>
</ul>
</li>
<li><a href="#org31c74a7">Running Times of 234-tree</a></li>
<li><a href="#org4521845">Another Approach to Duplicate Keys</a></li>
</ul>
</li>
<li><a href="#org90e268f">AVL TREE</a></li>
<li><a href="#org1f63dfe">Red-Black Tree-1</a></li>
<li><a href="#org1f5029b">Red-Black Tree-2</a></li>
<li><a href="#org3e22b54">summary:lec25 to lec27</a></li>
</ul>
</div>
</div>


<div id="org1cf2b57" class="outline-2">
<h2 id="org1cf2b57">2-3-4 TREES</h2>
<div class="outline-text-2" id="text-org1cf2b57">
<p>
Balaced tree(Not all are binary):
</p>
<ol class="org-ol">
<li><code>234</code> tree(a kind of B tree): ordered perfectly balance tree</li>
<li><code>splay tree</code> (BST)</li>
<li><code>AVL tree</code> (BST)(height-balanced)</li>
<li><code>Black-Red tree</code> (BST)(convert from/to 234-tree)(black-height)</li>
</ol>

<p>
Last lecture, we learned about the Ordered Dictionary ADT, and we learned one
data structure for implementing it: <code>*binary search trees*</code>. Today we learn a
faster one.
</p>

<p>
A <code>2-3-4</code> tree is a <span class="underline">perfectly balanced tree</span>. It has a big advantage over
regular binary search trees: because the tree is perfectly balanced, find,
insert, and remove operations take <span class="underline">O(log n)</span> time, <span class="underline">all of the leaves have the
same depth</span>, even in the worst case.
</p>

<p>
2-3-4 trees are thus named because every node has <span class="underline">2, 3, or 4 children</span>, except
leaves, which are all at the bottom level of the tree.  Each node stores
<span class="underline">1, 2, or 3 entries</span>, which determine how other entries are distributed among its
children's subtrees.
</p>

<p>
<b>Number of childern = keys + 1</b>
</p>

<pre class="example">
2 keys node has 3 children

                | key1 |  key2 |
                /     |        \
             /--      |         ---\
| []&lt; key1 |   | key1 &lt;[]&lt; key2 |   | [] &gt; key2 |

</pre>


<p>
Each internal (non-leaf) node has one more child than entries.  For example,
a node with keys [20, 40, 50] has four children.
</p>
<ul class="org-ul">
<li>Eack key k in the subtree rooted at the first child satisfies k &lt;= 20;</li>
<li>at the second child, 20 &lt;= k &lt;= 40;</li>
<li>at the third child, 40 &lt;= k &lt;= 50;</li>
<li>and at the fourth child, k &gt;= 50.</li>
</ul>
<p>
like this <a href="#org2555173">1</a>
</p>

<p>
234-tree 也是 order 的,因为 binarytree 就是 ordered
</p>
</div>

<div id="orgf0737e4" class="outline-3">
<h3 id="orgf0737e4">Main api of 234-tree</h3>
<div class="outline-text-3" id="text-orgf0737e4">
<p>
WARNING:  The algorithms for insertion and deletion I'll discuss today are
different from those discussed by Goodrich and Tamassia.  The text presents
"bottom-up" 2-3-4 trees, so named because the effects of node splits at the
bottom of the tree can work their way back up toward the root.  I'll discuss
"top-down" 2-3-4 trees, in which insertion and deletion finish at the leaves.
Top-down 2-3-4 trees are usually faster than bottom-up ones, because both trees
search down from the root to the leaves, but only the bottom-up trees sometimes
go back up to the root.  Goodrich and Tamassia call 2-3-4 trees "(2, 4) trees".
</p>

<p>
2-3-4 trees are a type of B-tree, which you may learn about someday in
connection with fast disk access for database systems.  B-trees on disks
usually use the top-down insertion/deletion algorithms, because accessing
a disk track is slow, so you'd rather not revisit it multiple times.
</p>
</div>

<div id="orgaf25218" class="outline-4">
<h4 id="orgaf25218">[1]  Entry find(Object k);</h4>
<div class="outline-text-4" id="text-orgaf25218">
<pre class="example" id="lec27-pic1">
Finding an entry is straightforward.        ==========
Start at the root.  At each node,           +20 40 50+
check for the key k; if it's not         /--==========------\
present, move down to the           /---/      /  \          \-----\
appropriate child chosen by     ----      ----      ----            =======
comparing k against the keys.   |14|      |32|      |43|            +70 79+
Continue until k is found,      ----      ----      ----            =======
or k is not found at a          /  \      /  \      /  \            /  |  \            &lt;&lt;lec27-pic1&gt;&gt;
leaf node.  For example,     ---- ---- ---- ---- ---- ---- ---------- ==== ----
find(74) visits the          |10| |18| |25| |33| |42| |47| |57 62 66| +74+ |81|
double-lined boxes at right. ---- ---- ---- ---- ---- ---- ---------- ==== ----
</pre>

<p>
Incidentally, you can define an inorder traversal on 2-3-4 trees analogous to
that on binary trees, and it visits the keys in sorted order.
</p>
</div>
</div>
