UCB_CS61_lec27.org
*** [2]  Entry insert(Object k, Object e);

insert(), like find(), walks down the tree in search of the key k. If it finds
an entry with key k, it proceeds to that entry's _"left child"_ and continues.

这里 left child 是针对某个 key 的，不是针对整个 node，比如 node = [20,40,80], 80
的 left-child就是 40~80 的这个 child。

一般我们会限制每个 node 能存储的最多 keys，比如这里 max(# of keys)=3 insert() 最
大的问题是如何在插入之后仍然保持整棵树的平衡，解决方法就是 _检测分割提升法_:在插
入之前按照 find()方法从 root 开始找位置，不同的是在找的过程中一旦 _检测_ 到达到
存储上线的 node就对其 _分割_ 并 _提升_ 中间节点为父节点。最后再在叶子 node 中的
适当位置插入。这个方法只在叶子 node 进行添加，不会在某个父节点进行，父节点的改变
主要是满载时改变 or 子节点满载上呈给父节点。

#+BEGIN_EXAMPLE
Unlike find(), insert() sometimes modifies             ----         -------
nodes of the tree as it walks down.                    |20|         |11 20|
Specifically, whenever insert() encounters             ----         -------
a 3-key node, the middle key is ejected,               /  \   =>    /  |  \
and is placed in the parent node instead.     ========== ----    ---- ---- ----
Since the parent was previously treated the   +10 11 12+ |30|    |10| |12| |30|
same way, the parent has at most two keys,    ========== ----    ---- ---- ----
and always has room for a third.  The other
two keys in the 3-key node are split into two separate 1-key nodes, which are
divided underneath the old middle key (as the figure illustrates).

#+END_EXAMPLE

#+BEGIN_EXAMPLE
For example, suppose we                      ----
insert 60 into the tree                      |40|                                  <<lec27-pic2>>
depicted in [1].  The                      /------\
first node visited is                 /---/        \----\
the root, which has three          ----                  ----
keys; so we kick the               |20|                  |50|
middle key (40) upstairs.          ----                /------\
Since the root node has           /    \              /        \
no parent, a new node         ----      ----      ----          ----------
is created to hold 40         |14|      |32|      |43|          |62 70 79|
and becomes the root.         ----      ----      ----          ----------
Similarly, 62 is kicked       /  \      /  \      /  \          /  |  |   \
upstairs when insert()     ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
finds the node containing  |10| |18| |25| |33| |42| |47| |57 60| |66| |74| |81|
it.  This ensures us that  ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
when we arrive at the leaf
(labeled 57 in this example), there's room to add the new key 60.
#+END_EXAMPLE

Observe that along the way, we created a new 3-key node "62 70 79".  We do not
kick its middle key upstairs until the next time it is visited.

Again, the reasons why we split every 3-key node we encounter (and move its
middle key up one level) are
1) to make sure there's room for the new key in the leaf node, and
2) to make sure that above the leaves, there's room for any key that gets kicked upstairs.
Sometimes, an insertion operation _increases the height_ of the tree by one by
creating a new root.
