UCB_CS61_lec27.html
<div id="orga63e38b" class="outline-4">
<h4 id="orga63e38b">[2]  Entry insert(Object k, Object e);</h4>
<div class="outline-text-4" id="text-orga63e38b">
<p>
insert(), like find(), walks down the tree in search of the key k. If it finds
an entry with key k, it proceeds to that entry's <span class="underline">"left child"</span> and continues.
</p>

<p>
这里 left child 是针对某个 key 的，不是针对整个 node，比如 node = [20,40,80], 80
的 left-child就是 40~80 的这个 child。
</p>

<p>
一般我们会限制每个 node 能存储的最多 keys，比如这里 max(# of keys)=3 insert() 最大的问题是如何在插入之后仍然保持整棵树的平衡，解决方法就是 <span class="underline">检测分割提升法</span>:在插入之前按照 find()方法从 root 开始找位置，不同的是在找的过程中一旦 <span class="underline">检测</span> 到达到存储上线的 node就对其 <span class="underline">分割</span> 并 <span class="underline">提升</span> 中间节点为父节点。最后再在叶子 node 中的适当位置插入。这个方法只在叶子 node 进行添加，不会在某个父节点进行，父节点的改变主要是满载时改变 or 子节点满载上呈给父节点。
</p>

<pre class="example">
Unlike find(), insert() sometimes modifies             ----         -------
nodes of the tree as it walks down.                    |20|         |11 20|
Specifically, whenever insert() encounters             ----         -------
a 3-key node, the middle key is ejected,               /  \   =&gt;    /  |  \
and is placed in the parent node instead.     ========== ----    ---- ---- ----
Since the parent was previously treated the   +10 11 12+ |30|    |10| |12| |30|
same way, the parent has at most two keys,    ========== ----    ---- ---- ----
and always has room for a third.  The other
two keys in the 3-key node are split into two separate 1-key nodes, which are
divided underneath the old middle key (as the figure illustrates).

</pre>

<pre class="example">
For example, suppose we                      ----
insert 60 into the tree                      |40|                                  &lt;&lt;lec27-pic2&gt;&gt;
depicted in [1].  The                      /------\
first node visited is                 /---/        \----\
the root, which has three          ----                  ----
keys; so we kick the               |20|                  |50|
middle key (40) upstairs.          ----                /------\
Since the root node has           /    \              /        \
no parent, a new node         ----      ----      ----          ----------
is created to hold 40         |14|      |32|      |43|          |62 70 79|
and becomes the root.         ----      ----      ----          ----------
Similarly, 62 is kicked       /  \      /  \      /  \          /  |  |   \
upstairs when insert()     ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
finds the node containing  |10| |18| |25| |33| |42| |47| |57 60| |66| |74| |81|
it.  This ensures us that  ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
when we arrive at the leaf
(labeled 57 in this example), there's room to add the new key 60.
</pre>

<p>
Observe that along the way, we created a new 3-key node "62 70 79".  We do not
kick its middle key upstairs until the next time it is visited.
</p>

<p>
Again, the reasons why we split every 3-key node we encounter (and move its
middle key up one level) are
</p>
<ol class="org-ol">
<li>to make sure there's room for the new key in the leaf node, and</li>
<li>to make sure that above the leaves, there's room for any key that gets kicked upstairs.</li>
</ol>
<p>
Sometimes, an insertion operation <span class="underline">increases the height</span> of the tree by one by
creating a new root.
</p>
</div>
</div>
