UCB_CS61_lec27.org
*** [3]  Entry remove(Object k);

2-3-4 tree remove() is similar to remove() on binary search trees: you find the
entry you want to remove (having key k).
- If it's in a leaf, you remove it.
- If it's in an internal node, you replace it with the entry with the next
  higher key. ( +似乎这个也可以实现类似 binary search tree 的 spell 自动纠错功
  能+ ),前面这个想法是错的。这里的意思是说，一旦找到这个 key，就用右子树中最小的
  (smallest higher)代替这个 key 的位置.

That entry is always in a leaf(原因同 insert()，因为在实际插入/删除之前都要进行
‘检测 分割/合并 上升/下降 法’). 意思是，在找这个节点的过程中(directily leaf or
changging internal with smallest higher),要对只有一个 entry 的节点进行处理。目的
是不让删除节点造成 234-树整体的不平衡. In either case, you remove an entry from
a leaf in the end.

Like insert(), remove() changes nodes of the tree as it walks down.  Whereas
insert() _eliminates 3-key nodes_ (moving keys up the tree) to make room for new
keys, remove() _eliminates 1-key nodes_ (pulling keys down the tree) so that a
key can be removed from a leaf without leaving it empty.  There are three ways
1-key nodes (except the root) are eliminated.

#+BEGIN_EXAMPLE
1)  When remove() encounters a 1-key  -------                  -------
node (except the root), it tries       |20 40|                  |20 50|
to steal a key from an adjacent        -------                  -------
sibling.  But we can't just steal      /  |  \          =>     /   |   \
the sibling's key without          ---- ==== ----------    ---- ------- -------
violating the search tree          |10| +30+ |50 51 52|    |10| |30 40| |51 52|
invariant.  This figure shows      ---- ==== ----------    ---- ------- -------
remove's action, called a           /\   /\   / |  | \      /\   / | \   / | \
"rotation", when it reaches "30".            S                        S
We move a
key _from the sibling to the parent_, and we move a key _from the parent to the 1-key node_.  We also move
a subtree S from the sibling to the 1-key node (now a 2-key node).
#+END_EXAMPLE

Goodrich & Tamassia call rotations "transfer" operations.
Note that we CAN'T steal a key from a _non-adjacent sibling_.

当相邻的兄弟有多于一个 entry, 用旋转，兄传父，父传我

#+BEGIN_EXAMPLE
2)  If no adjacent sibling has more than one     -------               ----
key, a rotation can't be used.  In this case,     |20 40|               |40|
the _1-key node steals a key from its parent_.    -------               ----
Since the parent was previously treated the       /  |  \    =>         /  \
same way (unless it's the root), it has at    ==== ---- ----    ---------- ----
least two keys, and can spare one.  The       +10+ |30| |50|    |10 20 30| |50|
sibling is also absorbed, and the 1-key node  ==== ---- ----    ---------- ----
becomes a 3-key node.  The figure illustrates
remove's action when it reaches "10".  This is called a "fusion" operation.

#+END_EXAMPLE


当相邻的兄弟只有一个 entry 且父节点不止一个节点，用融合,偷父合兄

#+BEGIN_EXAMPLE
3)  If the parent is the root and contains only one key, and the sibling
contains only one key, then the current 1-key node, its 1-key sibling, and the
1-key root are fused into one 3-key node that serves as the new root.  The
height of the tree decreases by one.
#+END_EXAMPLE

当父节点是根节点且只有一个 entry，兄弟节点也只有一个 entry， 和三为一，树深度减
一；

Eventually we reach a leaf.  After we process the leaf, it has at least two
keys (if there are at least two keys in the tree), so we can delete the key
and still have one key in the leaf.

#+BEGIN_EXAMPLE
For example, suppose we                  ----------
remove 40 from the large                 |20 xx 50|
tree depicted in  . The               /-----------------\
root node contains 40,            /--/      /   \        \-----\
which we mark "xx" to         ----      ----      ----          ----------
remind us that we plan to     |14|      |32|      |43|          |62 70 79|
replace it with the           ----      ----      ----          ----------
smallest key in the root      /  \      /  \      /  \          /  |  |   \
node's right subtree.  To  ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
find that key, we move on  |10| |18| |25| |33| |42| |47| |57 60| |66| |74| |81|
to the 1-key node labeled  ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
50.  Following our rules
for 1-key nodes, we fuse 50 with its sibling and parent to create a new 3-key
root labeled "20 xx 50".
#+END_EXAMPLE

有没有可能父节点不是根节点，且也只有一个 entry 的情况？

不可能，因为我是从上往下检查的，如果父节点只有一个，那肯定在检查到他时就已经处理
了。

#+BEGIN_EXAMPLE
Next, we visit the node                     ----------
labeled 43.  Again                          |20 xx 62|
following our rules for                 /--------------------\
1-key nodes, we rotate            /----/    /       \         \-----\
62 from a sibling to the      ----      ----      -------            -------
root, and move 50 from        |14|      |32|      |43 50|            |70 79|
the root to the node          ----      ----      -------            -------
containing 43.                /  \      /  \     /   |   \           /  |  \
                           ---- ---- ---- ---- ---- ---- ------- ---- ---- ----
                           |10| |18| |25| |33| |42| |47| |57 60| |66| |74| |81|
                           ---- ---- ---- ---- ---- ---- ------- ---- ---- ----

#+END_EXAMPLE

#+BEGIN_EXAMPLE
Finally, we move down to                    ----------
the node labeled 42.  A                     |20 xx 62|
different rule for 1-key               /--------------------\
nodes requires us to             /----/        /  \          \-----\
fuse the nodes labeled       ----      -------/    \------          -------
42 and 47 into a 3-key       |14|      |32|           |50|          |70 79|
node, stealing 43 from       ----      ----           ----          -------
the parent node.             /  \      /  \           /  \          /  |  \
                          ---- ---- ---- ---- ---------- ------- ---- ---- ----
                          |10| |18| |25| |33| |42 43 47| |57 60| |66| |74| |81|
                          ---- ---- ---- ---- ---------- ------- ---- ---- ----

#+END_EXAMPLE

The last step is to remove 42 from the leaf and replace "xx" with 42.

总结
#+BEGIN_EXAMPLE
                                                                 |                        /--> yes ====> 1+1+1 = 3
                                                                 | parent is 1-key root ? |
      /->leaf    ---->|                                     /--->|                        \--> No  ====> 偷父合兄
      |               |                              /-> yes
target|               | adjecent sibling 1-key node ?
      |               |                              \-> No
      \->internal---->|                                     \===> 兄->父->我

#+END_EXAMPLE

** Running Times of 234-tree
A 2-3-4 tree with height h has between 2^h and 4^h leaves.  If n is the total
number of entries (including entries in internal nodes), then n >= 2^(h+1) - 1.
By taking the logarithm of both sides, we find that h is in O(log n).

The time spent visiting a 2-3-4 node is typically longer than in a binary
search tree (because the nodes and the rotation and fusion operations are
complicated), but the time per node is still in O(1).

The number of nodes visited is proportional to the height of the tree.  Hence,
the running times of the find(), insert(), and remove() operations are in O(h)
and hence in _O(log n)_, even in the worst case.

Compare this with the Theta(n) worst-case time of ordinary binary search trees.

