UCB_CS61_lec27.org
** Another Approach to Duplicate Keys
Rather than have a separate node for each entry, we might wish to _collect all
the entries that share a common key in one node_. _In this case, each node's
entry becomes a list of entries_.

This simplifies the implementation of findAll(), which finds all the entries
with a specified key. It also speeds up other operations by leaving fewer nodes
in the tree data structure. Obviously, this is a change in the implementation,
but not a change in the dictionary ADT.

#+NAME: hashTable with this improvement
#+BEGIN_EXAMPLE
______________________
|  |  |  |  |  |  |  |
----|-----------------
    V
    ---   ---   ---
    |3|-->| |-->| |-->...  this is the entries with key = 3
    ---   ---   ---
    |
    v
    ---   ---   ---
    |7|-->| |-->| |-->...  this is the entries with key = 7
    ---   ---   ---

#+END_EXAMPLE

This idea can be used with hash tables, binary search trees, and 2-3-4 trees.

* AVL TREE
  AVL tree is a height-balanced BST
  1. 找到 avl-tree 深度的上界，并且不断 sharp 上界
     1. 开始用递归估算法，然后用给假设演绎证明法
  2. 找出 avl-tree 的三个 structure features
  3. 通过 3 个 features 找到与深度有关的更多 features
  4. insert(),need v,x,y,z(1st unbalanced when find from inserted node:v, y is z's child, x is y's child, in this line) rotation,
     1. 要求是 middle key endedup being at thetop
     2. ll or rr -> rotate once; rotate(y,z)
     3. lr or rl -> rotate twice; rotate(x,y), rotate(x,z)
     4. 所有的 rotate 操作都只需要 constant time，O(1),因为只需要改变几个链接就行，有大量的保持不变
  5. delete(),很麻烦，-1 的效果有可能一直上传，而不仅仅是 xyz 三者，所以
     找到 z（fist unbalance node）,rotate to balance this subtree, then if this balance tree's height -1, then go up to next unbalance
     node, which influenced by the rebalanced tree whose height reduce 1.

* Red-Black Tree-1
  what we want is using R&B tree as BST, but not losing its red and black property

  R&B-tree 如何保持平衡的呢，如果他只衡量黑 node 的个数作为高度？

  最高（所有点都算）是 2*|黑点| 最矮的情况是 1*|黑点|保证通往某个点的每一条路线
  上经过的黑点数量一致所以 rotate 或 recolor 之后，仍需要保证两点：所有的父辈的
  路线高度原来是多少，处理之后还是多少。

  Red-Black tree is a kind of BST
  case (1),just throw problem up 2 levels, (2)(3) really solver the problem.

  so case(1) will throw problem to his grandpa, grandpa go on checking and
  throwing up, until encount (2) (3).

  case (2) is bad orientation, (3) is a good orientation.

  case (2) must rotate to get to case (3)

  insert, we can ONLY insert red, because black will change the black-height:
  Key point is check uncle is Red or Black
  #+BEGIN_EXAMPLE
  1) insert a red ~left of right~ whose ~[father, uncle] -> Red~ , ~grandfather -> Black~.
     recolor(~[fater,uncle,grandfather] -> opposite~), then goto (1)or (2)or (3)
  2) insert a red, R(L) of L(R), whose ~father -> Red~, ~[uncle, grandfater] -> Black~
     [zigzag or zagzig]: rotate to (3)
  3) insert a red, R(L) of R(L), whose ~father -> Red~, ~[uncle, grandfater] -> Black~
     [zigzig or zagzag]: recolor(~[father,grandfather] -> opposite~) rotate
  #+END_EXAMPLE

* Red-Black Tree-2
  不但每一个 external 节点的 black height 一样，每一个子树的 black height 也一样。
  跟 AVL 树一样，都要统计某种高度，这里就是 black-height, avl 是统计 balance
  height.
  - balance height 的统计方法是，每个 node 都算 1, avl 树要求，每个节点的左右子树 balance height 相差最多为 1
  - black   height 的统计方法时，上面有几个 black-node,  r&b 树要求所有 external node 的 black height 都一样
  delete() 跟 BST 一样的概念，就是你删除的实际是：leaf(can be Red or Black) or a
  leaf' parent(by analysis, it ONLY has one situtation: parent is Black and
  childern is Red),如果某个节点只有左孩子或右孩子，

  [注意] 这里的 delete 只是删除 r or b 节点，不是指删除 external node。 在 RB 树
  中，external node 并不算做节点，节点只有两种：R and B 只有这三种情况，对于最后
  一种，可以分析 BB，RR，RB，BR 四种组合，最后发现删除操作只会出现在这种组合 BR
  中

  [注意] 删除一个 rorb 节点，就用一个 external node 代替这个节点。比如图 1
  #+NAME: 3SitutationsWhenDelete
  #+BEGIN_EXAMPLE


    (1)            (2)                     (3)
   -----          -----                   -----
  (  R  )        (  B  )                 ( B:19)
   --X--          --X--                   --X--
    / \            / \                     / \
   /   \          /   \                   /   \
  /     \        /     \                 /     \
 +-+    +-+     +-+    +-+            +-+     -----
 +-+    +-+     +-+    +-+            +-+    ( R:17)
                                              --X--
     |             |                           / \
     |             |                          /   \
     |             |                         /     \
     |             |                        +-+    +-+
     |             |                        +-+    +-+
     |             |
     |             |                       |
     |             |                       |
     |             |                       |
     |             |                       V
     |             |                     (2)
     |             |                    -----
     V             V                   (  B  )
                                        --X--
    +-+            ??                    / \
    +-+                                 /   \
                                       /     \
                                      +-+    +-+
                                      +-+    +-+
  #+END_EXAMPLE

  (1)(3) 情况都好处理，就是(2)会造成 external 的 black height 减少一，所以怎么办，
  依旧是 rotation。red black 的所有操作都可以和 234tree 对比。基本相互呼应。red
  black 的删除 delete() 操作对于图（2）的情况，哪个父亲的 black-node 被删除了，
  就以这个父亲为考虑起点，往下分析，功能分析出六种情况。
