UCB_CS61_lec27.html

<div id="org4521845" class="outline-3">
<h3 id="org4521845">Another Approach to Duplicate Keys</h3>
<div class="outline-text-3" id="text-org4521845">
<p>
Rather than have a separate node for each entry, we might wish to <span class="underline">collect all
the entries that share a common key in one node</span>. <span class="underline">In this case, each node's
entry becomes a list of entries</span>.
</p>

<p>
This simplifies the implementation of findAll(), which finds all the entries
with a specified key. It also speeds up other operations by leaving fewer nodes
in the tree data structure. Obviously, this is a change in the implementation,
but not a change in the dictionary ADT.
</p>

<pre class="example" id="hashTable with this improvement">
______________________
|  |  |  |  |  |  |  |
----|-----------------
    V
    ---   ---   ---
    |3|--&gt;| |--&gt;| |--&gt;...  this is the entries with key = 3
    ---   ---   ---
    |
    v
    ---   ---   ---
    |7|--&gt;| |--&gt;| |--&gt;...  this is the entries with key = 7
    ---   ---   ---

</pre>

<p>
This idea can be used with hash tables, binary search trees, and 2-3-4 trees.
</p>
</div>
</div>
</div>

<div id="org90e268f" class="outline-2">
<h2 id="org90e268f">AVL TREE</h2>
<div class="outline-text-2" id="text-org90e268f">
<p>
AVL tree is a height-balanced BST
</p>
<ol class="org-ol">
<li>找到 avl-tree 深度的上界，并且不断 sharp 上界
<ol class="org-ol">
<li>开始用递归估算法，然后用给假设演绎证明法</li>
</ol></li>
<li>找出 avl-tree 的三个 structure features</li>
<li>通过 3 个 features 找到与深度有关的更多 features</li>
<li>insert(),need v,x,y,z(1st unbalanced when find from inserted node:v, y is z's child, x is y's child, in this line) rotation,
<ol class="org-ol">
<li>要求是 middle key endedup being at thetop</li>
<li>ll or rr -&gt; rotate once; rotate(y,z)</li>
<li>lr or rl -&gt; rotate twice; rotate(x,y), rotate(x,z)</li>
<li>所有的 rotate 操作都只需要 constant time，O(1),因为只需要改变几个链接就行，有大量的保持不变</li>
</ol></li>
<li>delete(),很麻烦，-1 的效果有可能一直上传，而不仅仅是 xyz 三者，所以找到 z（fist unbalance node）,rotate to balance this subtree, then if this balance tree's height -1, then go up to next unbalance
node, which influenced by the rebalanced tree whose height reduce 1.</li>
</ol>
</div>
</div>

<div id="org1f63dfe" class="outline-2">
<h2 id="org1f63dfe">Red-Black Tree-1</h2>
<div class="outline-text-2" id="text-org1f63dfe">
<p>
what we want is using R&amp;B tree as BST, but not losing its red and black property
</p>

<p>
R&amp;B-tree 如何保持平衡的呢，如果他只衡量黑 node 的个数作为高度？
</p>

<p>
最高（所有点都算）是 2*|黑点| 最矮的情况是 1*|黑点|保证通往某个点的每一条路线上经过的黑点数量一致所以 rotate 或 recolor 之后，仍需要保证两点：所有的父辈的路线高度原来是多少，处理之后还是多少。
</p>

<p>
Red-Black tree is a kind of BST
case (1),just throw problem up 2 levels, (2)(3) really solver the problem.
</p>

<p>
so case(1) will throw problem to his grandpa, grandpa go on checking and
throwing up, until encount (2) (3).
</p>

<p>
case (2) is bad orientation, (3) is a good orientation.
</p>

<p>
case (2) must rotate to get to case (3)
</p>

<p>
insert, we can ONLY insert red, because black will change the black-height:
Key point is check uncle is Red or Black
</p>
<pre class="example">
1) insert a red ~left of right~ whose ~[father, uncle] -&gt; Red~ , ~grandfather -&gt; Black~.
   recolor(~[fater,uncle,grandfather] -&gt; opposite~), then goto (1)or (2)or (3)
2) insert a red, R(L) of L(R), whose ~father -&gt; Red~, ~[uncle, grandfater] -&gt; Black~
   [zigzag or zagzig]: rotate to (3)
3) insert a red, R(L) of R(L), whose ~father -&gt; Red~, ~[uncle, grandfater] -&gt; Black~
   [zigzig or zagzag]: recolor(~[father,grandfather] -&gt; opposite~) rotate
</pre>
</div>
</div>

<div id="org1f5029b" class="outline-2">
<h2 id="org1f5029b">Red-Black Tree-2</h2>
<div class="outline-text-2" id="text-org1f5029b">
<p>
不但每一个 external 节点的 black height 一样，每一个子树的 black height 也一样。跟 AVL 树一样，都要统计某种高度，这里就是 black-height, avl 是统计 balance
height.
</p>
<ul class="org-ul">
<li>balance height 的统计方法是，每个 node 都算 1, avl 树要求，每个节点的左右子树 balance height 相差最多为 1</li>
<li>black   height 的统计方法时，上面有几个 black-node,  r&amp;b 树要求所有 external node 的 black height 都一样</li>
</ul>
<p>
delete() 跟 BST 一样的概念，就是你删除的实际是：leaf(can be Red or Black) or a
leaf' parent(by analysis, it ONLY has one situtation: parent is Black and
childern is Red),如果某个节点只有左孩子或右孩子，
</p>

<p>
[注意] 这里的 delete 只是删除 r or b 节点，不是指删除 external node。 在 RB 树中，external node 并不算做节点，节点只有两种：R and B 只有这三种情况，对于最后一种，可以分析 BB，RR，RB，BR 四种组合，最后发现删除操作只会出现在这种组合 BR
中
</p>

<p>
[注意] 删除一个 rorb 节点，就用一个 external node 代替这个节点。比如图 1
</p>
<pre class="example" id="3SitutationsWhenDelete">


   (1)            (2)                     (3)
  -----          -----                   -----
 (  R  )        (  B  )                 ( B:19)
  --X--          --X--                   --X--
   / \            / \                     / \
  /   \          /   \                   /   \
 /     \        /     \                 /     \
+-+    +-+     +-+    +-+            +-+     -----
+-+    +-+     +-+    +-+            +-+    ( R:17)
                                             --X--
    |             |                           / \
    |             |                          /   \
    |             |                         /     \
    |             |                        +-+    +-+
    |             |                        +-+    +-+
    |             |
    |             |                       |
    |             |                       |
    |             |                       |
    |             |                       V
    |             |                     (2)
    |             |                    -----
    V             V                   (  B  )
                                       --X--
   +-+            ??                    / \
   +-+                                 /   \
                                      /     \
                                     +-+    +-+
                                     +-+    +-+
</pre>

<p>
(1)(3) 情况都好处理，就是(2)会造成 external 的 black height 减少一，所以怎么办，依旧是 rotation。red black 的所有操作都可以和 234tree 对比。基本相互呼应。red
black 的删除 delete() 操作对于图（2）的情况，哪个父亲的 black-node 被删除了，就以这个父亲为考虑起点，往下分析，功能分析出六种情况。
</p>
</div>
</div>
