UCB_CS61_lec27.org
* summary:lec25 to lec27
| Datastructure                   | logical                                                                                                                                                                               | physical                                                                                         | feature                                                                      | running time | application                                                                               |
|---------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------+--------------+-------------------------------------------------------------------------------------------|
| Priority Queue                  | Dictionary: - I/O: queue - order by value: Ordered(level-orderd: parent_value < children_value) keys indicate by indices of array Complete(except leaves of bottom level) Binary Tree | Array or LinkedList                                                                              | find min fast                                                                |              | event queue,  'key' is time the evet will take place,     'value' is the event            |
|---------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------+--------------+-------------------------------------------------------------------------------------------|
| Hash Table                      | Dictionary:                                                                                                                                                                           | Array + LinkedList, array for storing keys, linkedList for entry with, same keys(conflict occur) | farst for find                                                               |              |                                                                                           |
|---------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------+--------------+-------------------------------------------------------------------------------------------|
| Binary Search  Tree             | Dictionary: - order by key: Ordered(key: l < parent < r) Binary Tree                                                                                                                  | LinkedList                                                                                       | find min/max;find nearst                                                     |              | auto modification for miss spelling( by binary search tree can find nearst around target) |
|---------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------+--------------+-------------------------------------------------------------------------------------------|
| Balanced Search Tree (234-tree) | Dictionary: - order by key: - Orderd Complete Binary Tree - one node has 1/2/3 entry - one node has 2/3/4 children                                                                    | LinkedList                                                                                       | find min/max it's a little complex to keep balance when insert() or remove() | O(log n)     |                                                                                           |
