UCB_CS61_lec27.html
<div id="org3e22b54" class="outline-2">
<h2 id="org3e22b54">summary:lec25 to lec27</h2>
<div class="outline-text-2" id="text-org3e22b54">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Datastructure</th>
<th scope="col" class="org-left">logical</th>
<th scope="col" class="org-left">physical</th>
<th scope="col" class="org-left">feature</th>
<th scope="col" class="org-left">running time</th>
<th scope="col" class="org-left">application</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Priority Queue</td>
<td class="org-left">Dictionary: - I/O: queue - order by value: Ordered(level-orderd: parent_value &lt; children_value) keys indicate by indices of array Complete(except leaves of bottom level) Binary Tree</td>
<td class="org-left">Array or LinkedList</td>
<td class="org-left">find min fast</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">event queue,  'key' is time the evet will take place,     'value' is the event</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Hash Table</td>
<td class="org-left">Dictionary:</td>
<td class="org-left">Array + LinkedList, array for storing keys, linkedList for entry with, same keys(conflict occur)</td>
<td class="org-left">farst for find</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Binary Search  Tree</td>
<td class="org-left">Dictionary: - order by key: Ordered(key: l &lt; parent &lt; r) Binary Tree</td>
<td class="org-left">LinkedList</td>
<td class="org-left">find min/max;find nearst</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">auto modification for miss spelling( by binary search tree can find nearst around target)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Balanced Search Tree (234-tree)</td>
<td class="org-left">Dictionary: - order by key: - Orderd Complete Binary Tree - one node has 1/2/3 entry - one node has 2/3/4 children</td>
<td class="org-left">LinkedList</td>
<td class="org-left">find min/max it's a little complex to keep balance when insert() or remove()</td>
<td class="org-left">O(log n)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
